{"query": "are naturalization records public information", "sorted_docids": ["7119957", "4348282", "542113", "8133127", "2674124"], "re_rank_id": [3, 1, 5, 4, 2], "unsorted_docs": ["Civil Records Definition. Civil records are a group of public records that pertain to civil registry records, civil family matters and non criminal civil offenses. These records vary a lot because of the nature of the information that is recorded.", "See our FAQ's to learn how you can benefit by using our search. Share: DISCLAIMER: Due to the nature of the origin of public record information, the public records and commercially available data sources used in the PeopleWise system may contain errors.", "Yes, in most cases Public Records are available to the public. Some documents, such as certain court records, confidential personal information, and other sensitive information may be kept sealed or is only available with a court order. In certain states, there is a waiting period to obtain Public Records that reveal private information. Which government agencies provide Public Records? A number of government agencies maintain Public Records and make them available to the public. At the local level, many Public Records are held by County Clerk's Offices or Vital Records Offices. State Departments of Revenue or Departments of Health keep Public Records. At the federal level, the National Archives and Records Administration (NARA) is one agency that has Public Records.", "Spokeo pulls data and information from public records resources and consolidates it into a single view. An overview of Spokeo public records search engine for finding information about people. Spokeo pulls data and information from public records resources and consolidates it into a single view. An overview of Spokeo public records search engine for finding information about people.", "Public Records â\u0080\u0093 Exemptions and Redactions. Under Floridaâ\u0080\u0099s public records law, when a public record contains information that is. exempt from disclosure, the records custodian must redact the exempt information and. disclose the remainder of the public record."], "reason": {"ranked_passages": [{"identifier": 3, "direct_reason": "This passage directly discusses the availability of public records and the agencies that maintain them. It also mentions that certain sensitive information may be sealed or only available with a court order.", "listwise_reason": "Compared to other passages, this one provides the most comprehensive information about public records, including where they are held and their accessibility.", "direct_answer_sentence": "Yes, in most cases Public Records are available to the public. Some documents, such as certain court records, confidential personal information, and other sensitive information may be kept sealed or is only available with a court order."}, {"identifier": 1, "direct_reason": "This passage provides a definition of civil records, which could include naturalization records. However, it does not directly address the query.", "listwise_reason": "While it does not directly answer the query, it provides relevant background information about the nature of public records, which could include naturalization records.", "direct_answer_sentence": "Civil records are a group of public records that pertain to civil registry records, civil family matters and non criminal civil offenses."}, {"identifier": 5, "direct_reason": "This passage discusses exemptions and redactions in public records, which could apply to naturalization records. However, it does not directly address the query.", "listwise_reason": "This passage provides relevant information about the handling of sensitive information in public records, which could be applicable to naturalization records.", "direct_answer_sentence": "Under Floridaâ\u0080\u0099s public records law, when a public record contains information that is exempt from disclosure, the records custodian must redact the exempt information and disclose the remainder of the public record."}, {"identifier": 4, "direct_reason": "This passage discusses a specific search engine for public records, but does not directly address the query or provide relevant background information.", "listwise_reason": "Compared to other passages, this one provides less relevant information about public records in general and does not directly address the query.", "direct_answer_sentence": "Spokeo pulls data and information from public records resources and consolidates it into a single view."}, {"identifier": 2, "direct_reason": "This passage does not directly address the query or provide relevant background information.", "listwise_reason": "Compared to other passages, this one provides the least relevant information and does not directly address the query.", "direct_answer_sentence": "Due to the nature of the origin of public record information, the public records and commercially available data sources used in the PeopleWise system may contain errors."}]}, "scores": [10.066300392150879, 9.865500450134277, 9.644200325012207, 9.431699752807617, 9.385199546813965], "qid": 23849}